Repository: adkl/nsi
Catalog: NSI.Resources/Notifications/NotificationMessages.*.resx
Languages: bs

# AttachmentIdInvalid
source: Provided attachment ID not valid.
bs: Obezbjeđeni ID priloška nije validan.

# AttachmentWithIdDoesNotExist
source: Attachment with provided ID does not exist.
bs: Priložak sa obezbijeđenim ID-em ne postoji.

# EmailMessageIdInvalid
source: Provided email message ID not valid.
bs: Obezbjeđeni ID email poruke nije validan.

# EmailMessageWithIdDoesNotExist
source: Email message with provided ID does not exist.
bs: Email poruka sa obezbijeđenim ID-em ne postoji.

# EmailNotificationStatusIdInvalid
source: Provided notification status ID not valid.
bs: Obezbijeđeni ID statusa notifikacije nije validan.

# EmailRecipientAddressAlreadyExists
source: Email recipient with provided email address already exists.
bs: Primaoc emaila sa obezbijeđenom email adresom već postoji.

# EmailRecipientAddressEmpty
source: Email addres for recipient not provided
bs: Email adresa primaoca nije obezbjeđena

# EmailRecipientAddressInvalid
source: Email address for recipient is not valid.
bs: Email adresa primaoca nije validna.

# EmailRecipientIdInvalid
source: Provided email recipient ID is not valid.
bs: Obezbijeđeni ID primaoca emaila nije validan.

# EmailRecipientNotProvided
source: Email recipient details are not provided
bs: Detalji potrebni za primaoca emaila nisu obezbjeđeni.

# EmailRecipientTypeCodeAlreadyExists
source: Email recipient type with provided code already exists.
bs: Tip primaoca emaila sa obezbijeđenim kodom već postoji.

# EmailRecipientTypeCodeLengthExceeded
source: Email recipient type code can only have 100 characters maximum.
bs: Kod tipa primaoca emaila može imati najviše 100 karaktera.

# EmailRecipientTypeIdInvalid
source: Provided email recipient type ID not valid.
bs: Obezbijeđeni ID tipa primaoca emaila nije validan.

# EmailRecipientTypeNameLengthExceeded
source: Email recipient type name can only have 100 characters maximum.
bs: Naziv tipa primaoca emaila može imati najviše 100 karaktera.

# EmailRecipientTypeNotProvided
source: Email recipient type details are not provided.
bs: Detalji potrebni za tip primaoca emaila nisu obezbjeđeni.

# EmailRecipientTypeWithIdDoesNotExist
source: Email recipient type with provided ID does not exist.
bs: Tip primaoca emaila sa obezbijeđenim ID-em ne postoji.

# EmailRecipientWithIdDoesNotExist
source: Email recipient with provided ID does not exist.
bs: Primaoc emaila sa obezbijeđenim ID-em ne postoji.

# NotificationDateCreatedInvalid
source: Provided notification create date not valid.
bs: Obezbjeđeni datum kreiranja notifikacije nije validan.

# NotificationDateCreatedNotProvided
source: Notification create date is not provided.
bs: Datum kreiranja notifikacije nije obezbjeđen.

# NotificationExternalIdInvalid
source: Provided notification external ID not valid.
bs: Obezbijeđeni eksterni ID notifikacije emaila nije validan.

# NotificationExternalIdNotProvided
source: Notification external ID is not provided.
bs: Eksterni ID notifikacije nije obezbjeđen.

# NotificationIdInvalid
source: Provided notification ID not valid.
bs: Obezbjeđeni ID notifikacije nije validan.

# NotificationNotProvided
source: Notification details are not provided.
bs: Detalji potrebni za notifikaciju nisu obezbjeđeni.

# NotificationStatusIdDoesNotExist
source: Notification status with provided ID does not exist.
bs: Status notifikacije sa obezbijeđenim ID-em ne postoji.

# NotificationStatusIdNotProvided
source: Notification status ID is not provided.
bs: ID statusa notifikacije nije obezbjeđen.

# NotificationTypeIdInvalid
source: Provided notification type ID not valid.
bs: Obezbjeđeni ID za tip notifikacije nije validan.

# NotificationTypeIdNotProvided
source: Notification type ID is not provided.
bs: ID tipa notifikacije nije obezbjeđen.

# NotificationTypeWithIdDoesNotExist
source: Notification type with provided ID dooes not exist.
bs: Tip notifikacije sa obezbjeđenim ID-em ne postoji.

# NotificationWithIdDoesNotExist
source: Notification with provided ID does not exist.
bs: Notifikacija sa obezbijeđenim ID-em ne postoji.

source: Notification status code not provided.
bs: Kod statusa notifikacije nije zadan.

# NotificationStatusInvalidId
source: Invalid notification status ID.
bs: ID statusa notifikacije nije validan.

source: Notification status name not provided.
bs: Naziv statusa notifikacije nije zadan.

source: Notification status not provided.
bs: Status notifikacije nije zadan.

# NotificationStatusWithIdDoesNotExists
source: Notification status with provided ID does not exists.
bs: Status notifikacije sa datim ID-em ne postoji.

# SmsInvalidId
source: Invalid SMS ID.
bs: Nevažeći SMS ID.

# SmsInvalidNotificationId
source: Invalid notification ID.
bs: Nevažeći ID notifikacije.

# SmsInvalidPhoneNumberFormat
source: Invalid recipent phone number format.
bs: Nevažeći fromat telefonskog broja.

# SmsNotificationWithIdDoesNotExists
source: Notification with provided ID does not exists.
bs: Notifikacija sa zadanim ID-em ne postoji.

source: SMS not provided.
bs: SMS nije zadan.

# SmsWithIdDoesNotExists
source: SMS with provided ID does not exists.
bs: SMS sa datim ID-em ne postoji.

# NotificationTypeCodeEmpty
source: Notification type code not provided.
bs: Kod za tip notifikacije nije obezbjeđen.

# NotificationTypeNameEmpty
source: Notification type name not provided.
bs: Naziv za tip notifikacije nije obezbjeđen.

# NotificationTypeNotProvided
source: Notification type details not provided.
bs: Detalji potrebni za tip notifikacije nisu obezbjeđeni.

# WebNotificationDateSeenEmpty
source: Web notification date seen not provided.
bs: Vrijeme kad je web notifikacija pogledana nije obezbjeđeno.

# WebNotificationIdInvalid
source: Provided web notification ID not valid.
bs: Obezbjeđeni ID za web notifikaciju nije valdian.

# WebNotificationNotificationIdInvalid
source: Provided notification ID for web notification is not valid.
bs: Obezbjeđeni ID notifikacije za web notifikaciju nije validan.

# WebNotificationNotProvided
source: Web notification details not provided.
bs: Detalji potrebni za web notifikaciju nisu obezbjeđeni.

# Deleted
source: Object deleted.
bs: Objekat obrisan.

# Updated
source: Object updated.
bs: Objekat ažuriran.

# AttachmentFileNotProvided
source: File is not provided.
bs: Parametar fajl nije zadan.

source: Attachment not provided.
bs: Priložak nije zadan

# EmailRecipientTypeCodeEmpty
source: Email recipient type code can't be empty.
bs: Kod tipa primaoca emaila ne može biti prazan.

# NotificationTypeCodeExists
source: Notification type with sam code exists in database.
bs: U bazi postoji tip notifikacije sa istim kodom.

source: Notification id not provided.
bs: ID notifikacije nije obezbjeđen.

# NotificationUserIdInvalid
source: Provided notification user ID not valid.
bs: Obezbjeđeni ID nije validan.

# NotificationUserNotProvided
source: Notification user is not provided.
bs: NotificationUser nije obezbjeđen.

# NotificationUserWithIdDoesNotExist
source: NotificationUser with provided ID does not exist.
bs: Obezbijeđeni ID ne postoji.

# TenantIdInvalid
source: Provided tenant ID not valid.
bs: Obezbjeđeni tenant ID nije valdian.

source: Tenant id not provided.
bs: Tenant ID nije obezbjeđen.

# UserIdInvalid
source: Provided user ID not valid.
bs: Obezbjeđeni ID za korisnika nije valdian.

source: User id not provided.
bs: ID korisnika nije obezbjeđen.

# UserWithIdDoesNotExist
source: User with provided ID does not exists.
bs: Korisnik sa datim ID-em ne postoji.

# UserWithTenantIdDoesNotExist
source: User with provided tenant ID does not exists.
bs: Korisnik sa datim tenant ID-em ne postoji.

# EmailMessageSent
source: Email message successfully sent.
bs: Email poruka je uspješno poslata.

# WebNotificationUserDoesNotExist
source: User with provided ID in web notification request does not exist.
bs: Korisnik sa datim ID-em za web notifikaciju ne postoji.

# WebNotificationUserInfoIdInvalid
source: Provided ID for user in web notification request is invalid.
bs: ID korisnika za web notifikaciju nije validan.

# NotificationStatusWCodeAlreadyExists
source: Notification status with provided code already exists.
bs: Status notifikacije sa datim kodom postoji.

# EmailMessageInvalidFromFormat
source: Invalid sender email format error.
bs: Nevažeći format e-mail-a pošiljaoca.

# EmailMessageInvalidNotificationId
source: Invalid notification ID.
bs: Nevažeći ID notifikacije.

# EmailMessageNotificationWithIdDoesNotExists
source: Notification with provided ID does not exist.
bs: Notifikacija sa IDem ne postoji.

# EmailMessageNotProvided
source: Email Message is not provided.
bs: Email poruka nije zadana.

# EmailMessageIdInvalidFormat
source: Invalid Email Message ID.
bs: Nevažeći ID e-mail poruke.
